# **Assignment-DataAnalysis**

In [39]:
import pandas as pd
df_csv=pd.read_csv("brand_details.csv")
df_csv.head()

   Rank      Brand  Brand_Value  ...  Brand_Revenue  Company_Advertising    Industry
0     1      Apple        145.3  ...          182.3                  1.2  Technology
1     2  Microsoft         69.3  ...           93.3                  2.3  Technology
2     3     Google         65.6  ...           61.8                  3.0  Technology
3     4  Coca-Cola         56.0  ...           23.1                  3.5   Beverages
4     5        IBM         49.8  ...           92.8                  1.3  Technology

[5 rows x 7 columns]

**Problem 1 - Which industry has the maximum brands whose Brand_Revenue > 80 Million (Brand revenue is in millions)**

In [48]:
df_csv.loc[(df_csv.groupby(['Industry'])['Brand'].count().max())][['Industry']]

Industry    Technology
Name: 13, dtype: object

In [13]:
df_csv.loc[(df_csv.Industry=='Technology') & (df_csv['Brand_Revenue']>80)][['Industry','Brand_Revenue','Brand']]

      Industry  Brand_Revenue            Brand
0   Technology          182.3            Apple
1   Technology           93.3        Microsoft
4   Technology           92.8              IBM
6   Technology          187.8          Samsung
11  Technology           87.5           Amazon
25  Technology          111.5  Hewlett-Packard

### **Problem 2 - List the companiesd whose Company_Advertising budget is < 3 but Brand_Value is > 20**

In [16]:
df_csv.loc[(df_csv['Company_Advertising']<3) & (df_csv['Brand_Value'] > 20)][['Industry','Company_Advertising','Brand_Value']]

       Industry  Company_Advertising  Brand_Value
0    Technology                1.200        145.3
1    Technology                2.300         69.3
4    Technology                1.300         49.8
5   Restaurants                0.808         39.5
8    Technology                0.135         36.5
9       Leisure                2.800         34.6
13   Technology                0.196         27.6
14   Technology                0.079         26.8
16   Technology                1.800         25.8
17       Retail                2.400         24.7
18      Telecom                2.500         24.5
20   Automotive                2.700         22.6

### **Problem 3 - Find out the top 5 Technology Brand that showed maximum positive jump in their position (Use Change_LastYr)**

In [27]:
df[df['Industry']=='Technology'].nlargest(5,['Change_LastYr']) [['Industry','Brand','Change_LastYr']]

      Industry     Brand  Change_LastYr
8   Technology  Facebook             54
11  Technology    Amazon             32
33  Technology      Ebay             21
50  Technology      Sony             21
0   Technology     Apple             17

### **Problem 4 - Find out the Average Brand_Revenue by Industry**

In [23]:
df_csv.groupby(['Industry'])['Brand_Revenue'].mean()

Industry
Apparel                     17.700000
Automotive                  97.385714
Beverages                   13.133333
Business Services           32.800000
Consumer Packaged Goods      7.175000
Financial Services          51.622222
Heavy Equipment             36.100000
Leisure                     26.400000
Luxury                       5.900000
Media                        9.200000
Restaurants                 51.900000
Retail                     156.266667
Technology                  80.238462
Telecom                    129.750000
Transportation              47.200000
Name: Brand_Revenue, dtype: float64